In [ ]:
pandas ==>open source liabrary that is used for handle data manipulations.
data structure of pandas ==>
1. series ===> it is used for one dimensional data.it shows only value of a columnand it will not include column name.
2. data frame ===> it is multi-dimensional data. it shows column name with values

In [8]:
import pandas as pd

In [9]:
a = pd.Series([1,34,78,90])
a

0     1
1    34
2    78
3    90
dtype: int64

In [ ]:
(2). data frame ===>

In [11]:
a = {
    "EMP_ID" : [1,2,3,4,5,6,7,8],
    "NAME" : ['Sam' ,'Rahul' , 'Gaurav' , 'Aniket' ,'Anjali' ,'Pooja' , 'Muskan' , 'Raja'],
    "DEPARTMENT" : ['IT' ,'HR' ,'IT' ,'HR','IT','HR','IT','HR'],
    "SALARY" : [25000,27000,26000,23000,34000,32000,45000,56000],
    "WORKING_HOURS" : [8,9,7,8,9,7,8,9]
}

In [12]:
type(a)

dict

In [13]:
df = pd.DataFrame(a)
df

   EMP_ID    NAME DEPARTMENT  SALARY  WORKING_HOURS
0       1     Sam         IT   25000              8
1       2   Rahul         HR   27000              9
2       3  Gaurav         IT   26000              7
3       4  Aniket         HR   23000              8
4       5  Anjali         IT   34000              9
5       6   Pooja         HR   32000              7
6       7  Muskan         IT   45000              8
7       8    Raja         HR   56000              9

In [ ]:
#how to check top 5 data from a dataframe

In [14]:
df.head()

   EMP_ID    NAME DEPARTMENT  SALARY  WORKING_HOURS
0       1     Sam         IT   25000              8
1       2   Rahul         HR   27000              9
2       3  Gaurav         IT   26000              7
3       4  Aniket         HR   23000              8
4       5  Anjali         IT   34000              9

In [15]:
df.head(2)

   EMP_ID   NAME DEPARTMENT  SALARY  WORKING_HOURS
0       1    Sam         IT   25000              8
1       2  Rahul         HR   27000              9

In [ ]:
#how to check bottom data

In [19]:
df.tail()

   EMP_ID    NAME DEPARTMENT  SALARY  WORKING_HOURS
3       4  Aniket         HR   23000              8
4       5  Anjali         IT   34000              9
5       6   Pooja         HR   32000              7
6       7  Muskan         IT   45000              8
7       8    Raja         HR   56000              9

In [20]:
df.tail(3)

   EMP_ID    NAME DEPARTMENT  SALARY  WORKING_HOURS
5       6   Pooja         HR   32000              7
6       7  Muskan         IT   45000              8
7       8    Raja         HR   56000              9

In [21]:
df.tail(2)

   EMP_ID    NAME DEPARTMENT  SALARY  WORKING_HOURS
6       7  Muskan         IT   45000              8
7       8    Raja         HR   56000              9

In [ ]:
#how can we check random indexed data

In [16]:
df.sample(3)

   EMP_ID    NAME DEPARTMENT  SALARY  WORKING_HOURS
3       4  Aniket         HR   23000              8
0       1     Sam         IT   25000              8
6       7  Muskan         IT   45000              8

In [ ]:
#how to export our data

In [18]:
df.to_csv("C:\\Users\\snehr\\Desktop\\shubhi pdfs\\emp_info.csv")

In [ ]:
# step-1 (df.to_csv(" ")) 

# step-2  Create a new folder ==> copy location ===> paste it into step-1 
# df.to_csv("folder_location\\filename.csv")